MikroElektronika/core_packages/PIC/XC8/def/PIC18LF23K22/mcu.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0xF3D);
#ifndef _LIB_BUILD
asm("PMD2 equ 0F3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCMD                  :1;
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CTMUMD                 :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0xF3D);
// bitfield macros
#define _PMD2_ADCMD_POSN                                    0x0
#define _PMD2_ADCMD_POSITION                                0x0
#define _PMD2_ADCMD_SIZE                                    0x1
#define _PMD2_ADCMD_LENGTH                                  0x1
#define _PMD2_ADCMD_MASK                                    0x1
#define _PMD2_CMP1MD_POSN                                   0x1
#define _PMD2_CMP1MD_POSITION                               0x1
#define _PMD2_CMP1MD_SIZE                                   0x1
#define _PMD2_CMP1MD_LENGTH                                 0x1
#define _PMD2_CMP1MD_MASK                                   0x2
#define _PMD2_CMP2MD_POSN                                   0x2
#define _PMD2_CMP2MD_POSITION                               0x2
#define _PMD2_CMP2MD_SIZE                                   0x1
#define _PMD2_CMP2MD_LENGTH                                 0x1
#define _PMD2_CMP2MD_MASK                                   0x4
#define _PMD2_CTMUMD_POSN                                   0x3
#define _PMD2_CTMUMD_POSITION                               0x3
#define _PMD2_CTMUMD_SIZE                                   0x1
#define _PMD2_CTMUMD_LENGTH                                 0x1
#define _PMD2_CTMUMD_MASK                                   0x8

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0xF3E);
#ifndef _LIB_BUILD
asm("PMD1 equ 0F3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned                        :1;
        unsigned MSSP1MD                :1;
        unsigned MSSP2MD                :1;
    };
    struct {
        unsigned EMBMD                  :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0xF3E);
// bitfield macros
#define _PMD1_CCP1MD_POSN                                   0x0
#define _PMD1_CCP1MD_POSITION                               0x0
#define _PMD1_CCP1MD_SIZE                                   0x1
#define _PMD1_CCP1MD_LENGTH                                 0x1
#define _PMD1_CCP1MD_MASK                                   0x1
#define _PMD1_CCP2MD_POSN                                   0x1
#define _PMD1_CCP2MD_POSITION                               0x1
#define _PMD1_CCP2MD_SIZE                                   0x1
#define _PMD1_CCP2MD_LENGTH                                 0x1
#define _PMD1_CCP2MD_MASK                                   0x2
#define _PMD1_CCP3MD_POSN                                   0x2
#define _PMD1_CCP3MD_POSITION                               0x2
#define _PMD1_CCP3MD_SIZE                                   0x1
#define _PMD1_CCP3MD_LENGTH                                 0x1
#define _PMD1_CCP3MD_MASK                                   0x4
#define _PMD1_CCP4MD_POSN                                   0x3
#define _PMD1_CCP4MD_POSITION                               0x3
#define _PMD1_CCP4MD_SIZE                                   0x1
#define _PMD1_CCP4MD_LENGTH                                 0x1
#define _PMD1_CCP4MD_MASK                                   0x8
#define _PMD1_CCP5MD_POSN                                   0x4
#define _PMD1_CCP5MD_POSITION                               0x4
#define _PMD1_CCP5MD_SIZE                                   0x1
#define _PMD1_CCP5MD_LENGTH                                 0x1
#define _PMD1_CCP5MD_MASK                                   0x10
#define _PMD1_MSSP1MD_POSN                                  0x6
#define _PMD1_MSSP1MD_POSITION                              0x6
#define _PMD1_MSSP1MD_SIZE                                  0x1
#define _PMD1_MSSP1MD_LENGTH                                0x1
#define _PMD1_MSSP1MD_MASK                                  0x40
#define _PMD1_MSSP2MD_POSN                                  0x7
#define _PMD1_MSSP2MD_POSITION                              0x7
#define _PMD1_MSSP2MD_SIZE                                  0x1
#define _PMD1_MSSP2MD_LENGTH                                0x1
#define _PMD1_MSSP2MD_MASK                                  0x80
#define _PMD1_EMBMD_POSN                                    0x0
#define _PMD1_EMBMD_POSITION                                0x0
#define _PMD1_EMBMD_SIZE                                    0x1
#define _PMD1_EMBMD_LENGTH                                  0x1
#define _PMD1_EMBMD_MASK                                    0x1

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xF3F);
#ifndef _LIB_BUILD
asm("PMD0 equ 0F3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0xF3F);
// bitfield macros
#define _PMD0_TMR1MD_POSN                                   0x0
#define _PMD0_TMR1MD_POSITION                               0x0
#define _PMD0_TMR1MD_SIZE                                   0x1
#define _PMD0_TMR1MD_LENGTH                                 0x1
#define _PMD0_TMR1MD_MASK                                   0x1
#define _PMD0_TMR2MD_POSN                                   0x1
#define _PMD0_TMR2MD_POSITION                               0x1
#define _PMD0_TMR2MD_SIZE                                   0x1
#define _PMD0_TMR2MD_LENGTH                                 0x1
#define _PMD0_TMR2MD_MASK                                   0x2
#define _PMD0_TMR3MD_POSN                                   0x2
#define _PMD0_TMR3MD_POSITION                               0x2
#define _PMD0_TMR3MD_SIZE                                   0x1
#define _PMD0_TMR3MD_LENGTH                                 0x1
#define _PMD0_TMR3MD_MASK                                   0x4
#define _PMD0_TMR4MD_POSN                                   0x3
#define _PMD0_TMR4MD_POSITION                               0x3
#define _PMD0_TMR4MD_SIZE                                   0x1
#define _PMD0_TMR4MD_LENGTH                                 0x1
#define _PMD0_TMR4MD_MASK                                   0x8
#define _PMD0_TMR5MD_POSN                                   0x4
#define _PMD0_TMR5MD_POSITION                               0x4
#define _PMD0_TMR5MD_SIZE                                   0x1
#define _PMD0_TMR5MD_LENGTH                                 0x1
#define _PMD0_TMR5MD_MASK                                   0x10
#define _PMD0_TMR6MD_POSN                                   0x5
#define _PMD0_TMR6MD_POSITION                               0x5
#define _PMD0_TMR6MD_SIZE                                   0x1
#define _PMD0_TMR6MD_LENGTH                                 0x1
#define _PMD0_TMR6MD_MASK                                   0x20
#define _PMD0_UART1MD_POSN                                  0x6
#define _PMD0_UART1MD_POSITION                              0x6
#define _PMD0_UART1MD_SIZE                                  0x1
#define _PMD0_UART1MD_LENGTH                                0x1
#define _PMD0_UART1MD_MASK                                  0x40
#define _PMD0_UART2MD_POSN                                  0x7
#define _PMD0_UART2MD_POSITION                              0x7
#define _PMD0_UART2MD_SIZE                                  0x1
#define _PMD0_UART2MD_LENGTH                                0x1
#define _PMD0_UART2MD_MASK                                  0x80
#define _PMD0_SPI1MD_POSN                                   0x1
#define _PMD0_SPI1MD_POSITION                               0x1
#define _PMD0_SPI1MD_SIZE                                   0x1
#define _PMD0_SPI1MD_LENGTH                                 0x1
#define _PMD0_SPI1MD_MASK                                   0x2
#define _PMD0_SPI2MD_POSN                                   0x2
#define _PMD0_SPI2MD_POSITION                               0x2
#define _PMD0_SPI2MD_SIZE                                   0x1
#define _PMD0_SPI2MD_LENGTH                                 0x1
#define _PMD0_SPI2MD_MASK                                   0x4

