MikroElektronika/core_packages/PIC/XC8/def/PIC18LF23K22/mcu.h
extern volatile TX2REGbits_t TX2REGbits __at(0xF73);
// bitfield macros
#define _TX2REG_TX2REG_POSN                                 0x0
#define _TX2REG_TX2REG_POSITION                             0x0
#define _TX2REG_TX2REG_SIZE                                 0x8
#define _TX2REG_TX2REG_LENGTH                               0x8
#define _TX2REG_TX2REG_MASK                                 0xFF

// Register: RCREG2
#define RCREG2 RCREG2
extern volatile unsigned char           RCREG2              __at(0xF74);
#ifndef _LIB_BUILD
asm("RCREG2 equ 0F74h");
#endif
// aliases
extern volatile unsigned char           RC2REG              __at(0xF74);
#ifndef _LIB_BUILD
asm("RC2REG equ 0F74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC2REG                 :8;
    };
} RCREG2bits_t;
extern volatile RCREG2bits_t RCREG2bits __at(0xF74);
// bitfield macros
#define _RCREG2_RC2REG_POSN                                 0x0
#define _RCREG2_RC2REG_POSITION                             0x0
#define _RCREG2_RC2REG_SIZE                                 0x8
#define _RCREG2_RC2REG_LENGTH                               0x8
#define _RCREG2_RC2REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RC2REG                 :8;
    };
} RC2REGbits_t;
extern volatile RC2REGbits_t RC2REGbits __at(0xF74);
// bitfield macros
#define _RC2REG_RC2REG_POSN                                 0x0
#define _RC2REG_RC2REG_POSITION                             0x0
#define _RC2REG_RC2REG_SIZE                                 0x8
#define _RC2REG_RC2REG_LENGTH                               0x8
#define _RC2REG_RC2REG_MASK                                 0xFF

// Register: SPBRG2
#define SPBRG2 SPBRG2
extern volatile unsigned char           SPBRG2              __at(0xF75);
#ifndef _LIB_BUILD
asm("SPBRG2 equ 0F75h");
#endif
// aliases
extern volatile unsigned char           SP2BRG              __at(0xF75);
#ifndef _LIB_BUILD
asm("SP2BRG equ 0F75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP2BRG                 :8;
    };
} SPBRG2bits_t;
extern volatile SPBRG2bits_t SPBRG2bits __at(0xF75);
// bitfield macros
#define _SPBRG2_SP2BRG_POSN                                 0x0
#define _SPBRG2_SP2BRG_POSITION                             0x0
#define _SPBRG2_SP2BRG_SIZE                                 0x8
#define _SPBRG2_SP2BRG_LENGTH                               0x8
#define _SPBRG2_SP2BRG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP2BRG                 :8;
    };
} SP2BRGbits_t;
extern volatile SP2BRGbits_t SP2BRGbits __at(0xF75);
// bitfield macros
#define _SP2BRG_SP2BRG_POSN                                 0x0
#define _SP2BRG_SP2BRG_POSITION                             0x0
#define _SP2BRG_SP2BRG_SIZE                                 0x8
#define _SP2BRG_SP2BRG_LENGTH                               0x8
#define _SP2BRG_SP2BRG_MASK                                 0xFF

// Register: SPBRGH2
#define SPBRGH2 SPBRGH2
extern volatile unsigned char           SPBRGH2             __at(0xF76);
#ifndef _LIB_BUILD
asm("SPBRGH2 equ 0F76h");
#endif
// aliases
extern volatile unsigned char           SP2BRGH             __at(0xF76);
#ifndef _LIB_BUILD
asm("SP2BRGH equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP2BRGH                :8;
    };
} SPBRGH2bits_t;
extern volatile SPBRGH2bits_t SPBRGH2bits __at(0xF76);
// bitfield macros
#define _SPBRGH2_SP2BRGH_POSN                               0x0
#define _SPBRGH2_SP2BRGH_POSITION                           0x0
#define _SPBRGH2_SP2BRGH_SIZE                               0x8
#define _SPBRGH2_SP2BRGH_LENGTH                             0x8
#define _SPBRGH2_SP2BRGH_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP2BRGH                :8;
    };
} SP2BRGHbits_t;
extern volatile SP2BRGHbits_t SP2BRGHbits __at(0xF76);
// bitfield macros
#define _SP2BRGH_SP2BRGH_POSN                               0x0
#define _SP2BRGH_SP2BRGH_POSITION                           0x0
#define _SP2BRGH_SP2BRGH_SIZE                               0x8
#define _SP2BRGH_SP2BRGH_LENGTH                             0x8
#define _SP2BRGH_SP2BRGH_MASK                               0xFF

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0xF77);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 0F77h");
#endif
// aliases
extern volatile unsigned char           CM12CON             __at(0xF77);
#ifndef _LIB_BUILD
asm("CM12CON equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned C1SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned C1HYS                  :1;
        unsigned C2RSEL                 :1;
        unsigned C1RSEL                 :1;
        unsigned MC2OUT                 :1;
        unsigned MC1OUT                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0xF77);
// bitfield macros
#define _CM2CON1_C2SYNC_POSN                                0x0
#define _CM2CON1_C2SYNC_POSITION                            0x0
#define _CM2CON1_C2SYNC_SIZE                                0x1
#define _CM2CON1_C2SYNC_LENGTH                              0x1
#define _CM2CON1_C2SYNC_MASK                                0x1
#define _CM2CON1_C1SYNC_POSN                                0x1
#define _CM2CON1_C1SYNC_POSITION                            0x1
#define _CM2CON1_C1SYNC_SIZE                                0x1
#define _CM2CON1_C1SYNC_LENGTH                              0x1
#define _CM2CON1_C1SYNC_MASK                                0x2
#define _CM2CON1_C2HYS_POSN                                 0x2
#define _CM2CON1_C2HYS_POSITION                             0x2
#define _CM2CON1_C2HYS_SIZE                                 0x1
#define _CM2CON1_C2HYS_LENGTH                               0x1
#define _CM2CON1_C2HYS_MASK                                 0x4
#define _CM2CON1_C1HYS_POSN                                 0x3
#define _CM2CON1_C1HYS_POSITION                             0x3
#define _CM2CON1_C1HYS_SIZE                                 0x1
#define _CM2CON1_C1HYS_LENGTH                               0x1
#define _CM2CON1_C1HYS_MASK                                 0x8
#define _CM2CON1_C2RSEL_POSN                                0x4
#define _CM2CON1_C2RSEL_POSITION                            0x4
#define _CM2CON1_C2RSEL_SIZE                                0x1
#define _CM2CON1_C2RSEL_LENGTH                              0x1
#define _CM2CON1_C2RSEL_MASK                                0x10
#define _CM2CON1_C1RSEL_POSN                                0x5
#define _CM2CON1_C1RSEL_POSITION                            0x5
#define _CM2CON1_C1RSEL_SIZE                                0x1
#define _CM2CON1_C1RSEL_LENGTH                              0x1
#define _CM2CON1_C1RSEL_MASK                                0x20
#define _CM2CON1_MC2OUT_POSN                                0x6
#define _CM2CON1_MC2OUT_POSITION                            0x6
#define _CM2CON1_MC2OUT_SIZE                                0x1
#define _CM2CON1_MC2OUT_LENGTH                              0x1
#define _CM2CON1_MC2OUT_MASK                                0x40
#define _CM2CON1_MC1OUT_POSN                                0x7
#define _CM2CON1_MC1OUT_POSITION                            0x7
#define _CM2CON1_MC1OUT_SIZE                                0x1
#define _CM2CON1_MC1OUT_LENGTH                              0x1
#define _CM2CON1_MC1OUT_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned C1SYNC                 :1;
        unsigned C2HYS                  :1;
        unsigned C1HYS                  :1;
        unsigned C2RSEL                 :1;
        unsigned C1RSEL                 :1;
        unsigned MC2OUT                 :1;
        unsigned MC1OUT                 :1;
    };
} CM12CONbits_t;
extern volatile CM12CONbits_t CM12CONbits __at(0xF77);
// bitfield macros
#define _CM12CON_C2SYNC_POSN                                0x0
#define _CM12CON_C2SYNC_POSITION                            0x0
#define _CM12CON_C2SYNC_SIZE                                0x1
#define _CM12CON_C2SYNC_LENGTH                              0x1
#define _CM12CON_C2SYNC_MASK                                0x1
#define _CM12CON_C1SYNC_POSN                                0x1
#define _CM12CON_C1SYNC_POSITION                            0x1
#define _CM12CON_C1SYNC_SIZE                                0x1
#define _CM12CON_C1SYNC_LENGTH                              0x1
#define _CM12CON_C1SYNC_MASK                                0x2
#define _CM12CON_C2HYS_POSN                                 0x2
#define _CM12CON_C2HYS_POSITION                             0x2
#define _CM12CON_C2HYS_SIZE                                 0x1
#define _CM12CON_C2HYS_LENGTH                               0x1
#define _CM12CON_C2HYS_MASK                                 0x4
#define _CM12CON_C1HYS_POSN                                 0x3
#define _CM12CON_C1HYS_POSITION                             0x3
#define _CM12CON_C1HYS_SIZE                                 0x1
#define _CM12CON_C1HYS_LENGTH                               0x1
#define _CM12CON_C1HYS_MASK                                 0x8
#define _CM12CON_C2RSEL_POSN                                0x4
#define _CM12CON_C2RSEL_POSITION                            0x4
#define _CM12CON_C2RSEL_SIZE                                0x1
#define _CM12CON_C2RSEL_LENGTH                              0x1
#define _CM12CON_C2RSEL_MASK                                0x10
#define _CM12CON_C1RSEL_POSN                                0x5
#define _CM12CON_C1RSEL_POSITION                            0x5
#define _CM12CON_C1RSEL_SIZE                                0x1
#define _CM12CON_C1RSEL_LENGTH                              0x1
#define _CM12CON_C1RSEL_MASK                                0x20
#define _CM12CON_MC2OUT_POSN                                0x6
#define _CM12CON_MC2OUT_POSITION                            0x6
#define _CM12CON_MC2OUT_SIZE                                0x1
#define _CM12CON_MC2OUT_LENGTH                              0x1
#define _CM12CON_MC2OUT_MASK                                0x40
#define _CM12CON_MC1OUT_POSN                                0x7
#define _CM12CON_MC1OUT_POSITION                            0x7
#define _CM12CON_MC1OUT_SIZE                                0x1
#define _CM12CON_MC1OUT_LENGTH                              0x1
#define _CM12CON_MC1OUT_MASK                                0x80

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0xF78);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 0F78h");
#endif
// aliases
extern volatile unsigned char           CM2CON              __at(0xF78);
#ifndef _LIB_BUILD
asm("CM2CON equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2CH                   :2;
        unsigned C2R                    :1;
        unsigned C2SP                   :1;
        unsigned C2POL                  :1;
        unsigned C2OE                   :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
    struct {
        unsigned C2CH0                  :1;
        unsigned C2CH1                  :1;
    };
    struct {
        unsigned CCH02                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH12                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned COE2                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned CON2                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CPOL2                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CREF2                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned EVPOL02                :1;
    };
    struct {
        unsigned                        :4;
        unsigned EVPOL12                :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0xF78);
// bitfield macros
#define _CM2CON0_C2CH_POSN                                  0x0
#define _CM2CON0_C2CH_POSITION                              0x0
#define _CM2CON0_C2CH_SIZE                                  0x2
#define _CM2CON0_C2CH_LENGTH                                0x2
#define _CM2CON0_C2CH_MASK                                  0x3
#define _CM2CON0_C2R_POSN                                   0x2
#define _CM2CON0_C2R_POSITION                               0x2
#define _CM2CON0_C2R_SIZE                                   0x1
#define _CM2CON0_C2R_LENGTH                                 0x1
#define _CM2CON0_C2R_MASK                                   0x4
#define _CM2CON0_C2SP_POSN                                  0x3
#define _CM2CON0_C2SP_POSITION                              0x3
#define _CM2CON0_C2SP_SIZE                                  0x1
#define _CM2CON0_C2SP_LENGTH                                0x1
#define _CM2CON0_C2SP_MASK                                  0x8
#define _CM2CON0_C2POL_POSN                                 0x4
#define _CM2CON0_C2POL_POSITION                             0x4
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x10
#define _CM2CON0_C2OE_POSN                                  0x5
#define _CM2CON0_C2OE_POSITION                              0x5
#define _CM2CON0_C2OE_SIZE                                  0x1
#define _CM2CON0_C2OE_LENGTH                                0x1
#define _CM2CON0_C2OE_MASK                                  0x20
#define _CM2CON0_C2OUT_POSN                                 0x6
#define _CM2CON0_C2OUT_POSITION                             0x6
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x40
#define _CM2CON0_C2ON_POSN                                  0x7
#define _CM2CON0_C2ON_POSITION                              0x7
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x80
#define _CM2CON0_C2CH0_POSN                                 0x0
#define _CM2CON0_C2CH0_POSITION                             0x0
#define _CM2CON0_C2CH0_SIZE                                 0x1
#define _CM2CON0_C2CH0_LENGTH                               0x1
#define _CM2CON0_C2CH0_MASK                                 0x1
#define _CM2CON0_C2CH1_POSN                                 0x1
#define _CM2CON0_C2CH1_POSITION                             0x1
#define _CM2CON0_C2CH1_SIZE                                 0x1
#define _CM2CON0_C2CH1_LENGTH                               0x1
#define _CM2CON0_C2CH1_MASK                                 0x2
#define _CM2CON0_CCH02_POSN                                 0x0
#define _CM2CON0_CCH02_POSITION                             0x0
#define _CM2CON0_CCH02_SIZE                                 0x1
#define _CM2CON0_CCH02_LENGTH                               0x1
#define _CM2CON0_CCH02_MASK                                 0x1
#define _CM2CON0_CCH12_POSN                                 0x1
#define _CM2CON0_CCH12_POSITION                             0x1
#define _CM2CON0_CCH12_SIZE                                 0x1
#define _CM2CON0_CCH12_LENGTH                               0x1
#define _CM2CON0_CCH12_MASK                                 0x2
#define _CM2CON0_COE2_POSN                                  0x6
#define _CM2CON0_COE2_POSITION                              0x6
#define _CM2CON0_COE2_SIZE                                  0x1
#define _CM2CON0_COE2_LENGTH                                0x1
#define _CM2CON0_COE2_MASK                                  0x40
#define _CM2CON0_CON2_POSN                                  0x7
#define _CM2CON0_CON2_POSITION                              0x7
#define _CM2CON0_CON2_SIZE                                  0x1
#define _CM2CON0_CON2_LENGTH                                0x1
#define _CM2CON0_CON2_MASK                                  0x80
#define _CM2CON0_CPOL2_POSN                                 0x5
#define _CM2CON0_CPOL2_POSITION                             0x5
#define _CM2CON0_CPOL2_SIZE                                 0x1
#define _CM2CON0_CPOL2_LENGTH                               0x1
#define _CM2CON0_CPOL2_MASK                                 0x20
#define _CM2CON0_CREF2_POSN                                 0x2
#define _CM2CON0_CREF2_POSITION                             0x2
#define _CM2CON0_CREF2_SIZE                                 0x1
#define _CM2CON0_CREF2_LENGTH                               0x1
#define _CM2CON0_CREF2_MASK                                 0x4
#define _CM2CON0_EVPOL02_POSN                               0x3
#define _CM2CON0_EVPOL02_POSITION                           0x3
#define _CM2CON0_EVPOL02_SIZE                               0x1
#define _CM2CON0_EVPOL02_LENGTH                             0x1
#define _CM2CON0_EVPOL02_MASK                               0x8
#define _CM2CON0_EVPOL12_POSN                               0x4
#define _CM2CON0_EVPOL12_POSITION                           0x4
#define _CM2CON0_EVPOL12_SIZE                               0x1
#define _CM2CON0_EVPOL12_LENGTH                             0x1
#define _CM2CON0_EVPOL12_MASK                               0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned C2CH                   :2;
        unsigned C2R                    :1;
        unsigned C2SP                   :1;
        unsigned C2POL                  :1;
        unsigned C2OE                   :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
    struct {
        unsigned C2CH0                  :1;
        unsigned C2CH1                  :1;
    };
    struct {
        unsigned CCH02                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCH12                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned COE2                   :1;
    };
    struct {
        unsigned                        :7;
        unsigned CON2                   :1;
    };
    struct {
        unsigned                        :5;
        unsigned CPOL2                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CREF2                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned EVPOL02                :1;
    };
    struct {
        unsigned                        :4;
        unsigned EVPOL12                :1;
    };
} CM2CONbits_t;
